//Автор: Руслан Сакевич
//Умова задачі: 
//Модифікувати роботу таким чином, щоб програма могла отримувати на вхід параметр --name або параметр -n. 
//Значення данного параметра - це ім'я, яке повинна надрукувати програма у своєму повідомленні.
//Якщо параметр отримано, тоді програма не запитує ім'я користувача, а одразу друкує повідомлення. 
//Якщо параметра не задано - програма зчитує ім'я користувача з клавіатури.
//Формат віхдних даних: Програма читає з клавіатури стрічку, або з консоліз параметром --name або -n.
#include <iostream>
#include <string>

using namespace std;

int main(int argv, char** argc) {
	string name = "";
	if ((argv > 2) && ((strcmp(argc[1], "-n") == 0) || (strcmp(argc[1], "--name") == 0))) {
		for (int i = 2; i < argv; ++i) {
			name += argc[i];
			if (argv - i > 1) name += " ";
		}
	}
	else {
		cout << "Enter your name: ";
		cin >> name;
	}
	cout << "Hello " << name << "!" << endl;
	system("pause");
	return 0;
}